using System;

namespace BotFix
{
    public class ValidSubjects
    {
        static public readonly List<List<string>> Titles =
        [
            [
                "undefined",
                "null",
                "неопределено",
                "неизвестно",
                "честно хз",
                "хз"
            ],

            [
                "английский язык",
                "английский яз",
                "английский",
                "англ яз",
                "англяз",
                "англ"

            ],

            [
                "алгебра"
            ],

            [
                "биология",
                "биолог",
                "био"
            ],

            [
                "вероятность и статистика",
                "вероятность",
                "теорвер",
                "вис"
            ],

            [
                "всеобщая история",
                "мировая история",
                "общая история",
                "всобщ история",
                "общ история",
                "история"
            ],

            [
                "геометрия",
                "геома"
            ],

            [
                "география",
                "геошрафия",
                "геошр"
            ],

            [
                "изобразительное исскуство",
                "изо"
            ],

            [
                "индивидуальный проект",
                "проект",
                "ип"
            ],

            [
                "иностранный язык",
                "ин язык",
                "ин яз",
                "иняз"
            ],

            [
                "информатика",
                "информа",
                "инфа",
                "инф",
                "икт"
            ],

            [
                "исскусство музыка",
                "исскусство музыки",

                "исскуство музыка",
                "исскуство музыки",

                "искусство музыка",
                "искусство музыки",

                "искуство музыка",
                "искуство музыки",

                "музыка",
                "муз"
            ],

            [
                "история россии",
                "история росии",
                "история рос",
                "рос история"
            ],

            [
                "литературное чтение",
                "литература",
                "литра"
            ],

            [
                "математика",
                "матем",
                "мат"
            ],

            [
                "обзр",
                "обж"
            ],

            [
                "обществознание",
                "общество",
                "общага"
            ],

            [
                "окружающий мир",
                "окружайка",
                "окр мир",
                "окр"
            ],

            [
                "путь к созданию текста",
                "путь к тексту",
                "текст",
                "путь",
                "пкст",
                "пст"
            ],

            [
                "разговоры о влажном",
                "разговоры о важном",
                "разговоры",
                "ров"
            ],

            [
                "робототехника",
                "роботехника"
            ],

            [
                "русский язык",
                "русский яз",
                "русский",
                "рус яз",
                "русяз",
                "рус"
            ],

            [
                "технология",
                "технолог",
                "детский труд",
                "дет труд",
                "труд"
            ],

            [
                "физика",
                "физик",
                "физ"
            ],

            [
                "физическая культура",
                "физкультура",
                "физ-ра",
                "физ ра",
                "физра"
            ],

            [
                "химоза",
                "хуимия",
                "химия",
                "хим"
            ],
        ];
    }
}
